sleemanj/ATTinyCore/avr/boards.txt
attiny828.name=ATtiny828
attiny828.upload.maximum_size=8192
attiny828.upload.maximum_data_size=512
attiny828.upload.tool=avrdude
attiny828.bootloader.tool=avrdude
attiny828.bootloader.unlock_bits=0x3F
attiny828.bootloader.lock_bits=0x3F
attiny828.build.mcu=attiny828
attiny828.build.core=tinymodern
attiny828.build.board=AVR_ATTINY828
attiny828.menu.clock.8internal=8 MHz (internal)
attiny828.menu.clock.8internal.bootloader.low_fuses=0xEE
attiny828.menu.clock.8internal.build.f_cpu=8000000L
attiny828.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attiny828.menu.clock.1internal=1 MHz (internal)
attiny828.menu.clock.1internal.bootloader.low_fuses=0x6E
attiny828.menu.clock.1internal.build.f_cpu=1000000L
attiny828.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attiny828.menu.bod.disable=Disabled
attiny828.menu.bod.disable.bootloader.extended_fuses=0xFF
attiny828.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828.menu.bod.1v8.bootloader.extended_fuses=0x5F
attiny828.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828.menu.bod.2v7.bootloader.extended_fuses=0x5F
attiny828.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828.menu.bod.4v3.bootloader.extended_fuses=0x5F
attiny828.menu.bod.4v3.bootloader.high_fuses=0xD4

attiny828opti.name=ATtiny828 (Optiboot)
attiny828opti.upload.maximum_size=7680
attiny828opti.upload.maximum_data_size=512
attiny828opti.upload.protocol=arduino
attiny828opti.upload.speed=57600
attiny828opti.upload.tool=avrdude
attiny828opti.bootloader.tool=avrdude
attiny828opti.bootloader.unlock_bits=0x3F
attiny828opti.bootloader.lock_bits=0x3F
attiny828opti.build.mcu=attiny828
attiny828opti.build.core=tinymodern
attiny828opti.build.board=AVR_ATTINY828
attiny828opti.bootloader.low_fuses=0xEE
attiny828opti.build.f_cpu=8000000L
attiny828opti.menu.vcc.3v3=Under 4.0 V
attiny828opti.menu.vcc.3v3.bootloader.file=optiboot/optiboot_attiny828at8.hex
attiny828opti.menu.vcc.5v=Over 4.0 V
attiny828opti.menu.vcc.5v.bootloader.file=optiboot/optiboot_attiny828at8_5v.hex
attiny828opti.menu.bod.disable=Disabled
attiny828opti.menu.bod.disable.bootloader.extended_fuses=0xFA
attiny828opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828opti.menu.bod.1v8.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.1v8.bootloader.high_fuses=0xD7
attiny828opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828opti.menu.bod.2v7.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny828opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828opti.menu.bod.4v3.bootloader.extended_fuses=0x5A
attiny828opti.menu.bod.4v3.bootloader.high_fuses=0xD4


attiny13.name=ATtiny13
attiny13.upload.maximum_size=1024
attiny13.upload.maximum_data_size=64
attiny13.upload.tool=avrdude_noefuse
attiny13.bootloader.tool=avrdude_nobootloader_noefuse
attiny13.bootloader.unlock_bits=0x3F
attiny13.bootloader.lock_bits=0x3F
attiny13.build.core=tiny
attiny13.build.board=AVR_ATTINY13
attiny13.menu.chip.13=ATtiny13
attiny13.menu.chip.13.build.mcu=attiny13
attiny13.menu.chip.13.upload.maximum_size=1024
attiny13.menu.chip.13.upload.maximum_data_size=64
attiny13.menu.clock.96internal=9.6 MHz (internal)
attiny13.menu.clock.96internal.bootloader.low_fuses=0x7A
attiny13.menu.clock.96internal.build.f_cpu=9600000L
attiny13.menu.clock.96internal.bootloader.file=empty/empty_all.hex
attiny13.menu.clock.48internal=4.8 MHz (internal)
attiny13.menu.clock.48internal.bootloader.low_fuses=0x79
attiny13.menu.clock.48internal.build.f_cpu=4800000L
attiny13.menu.clock.48internal.bootloader.file=empty/empty_all.hex
attiny13.menu.clock.12internal=1.2 MHz (internal)
attiny13.menu.clock.12internal.bootloader.low_fuses=0x62
attiny13.menu.clock.12internal.build.f_cpu=1200000L
attiny13.menu.clock.12internal.bootloader.file=empty/empty_all.hex
attiny13.menu.bod.disable=B.O.D. Disabled
attiny13.menu.bod.disable.bootloader.high_fuses=0xFF
attiny13.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny13.menu.bod.1v8.bootloader.high_fuses=0xFD
attiny13.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny13.menu.bod.2v7.bootloader.high_fuses=0xFB
attiny13.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny13.menu.bod.4v3.bootloader.high_fuses=0xF9
attiny13.build.variant=tiny13
attiny13.build.extra_flags=-DNO_TONE


# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny13.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny13.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny13.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny13.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny13.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny13.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

# The tiny13 doesn't have enough RAM to do Arbitrary Bases
# attiny13.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
# attiny13.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny13.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny13.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny13.menu.print.Dec=Dec Only Supported
attiny13.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny13.menu.print.Hex=Hex Only Supported
attiny13.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny13.menu.print.Oct=Oct Only Supported
attiny13.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny13.menu.print.Bin=Bin Only Supported (Smallest)
attiny13.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN


