sleemanj/ATTinyCore/avr/boards.txt
# Millis Accuracy (tiny13 only currently)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny13.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny13.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny13.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny13.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny13.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny13.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny13.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny13.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny13.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny13.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny13.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny13.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny13.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny13.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny13.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny13.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny13.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny13.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny13.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL



attinyx5.name=ATtiny x5 series
attinyx5.upload.maximum_size=8192
attinyx5.upload.maximum_data_size=512
attinyx5.upload.tool=avrdude
attinyx5.bootloader.tool=avrdude
attinyx5.bootloader.unlock_bits=0xFF
attinyx5.bootloader.lock_bits=0xFF
attinyx5.build.core=tiny
attinyx5.build.board=AVR_ATTINYX5
attinyx5.bootloader.extended_fuses=0xFF
attinyx5.menu.TimerClockSource.default=CPU
attinyx5.menu.TimerClockSource.pll=64MHz
attinyx5.menu.TimerClockSource.pll.build.extra_flags=-DPLLTIMER1
attinyx5.menu.TimerClockSource.lowpll=32MHz
attinyx5.menu.TimerClockSource.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx5.menu.chip.85=ATtiny85
attinyx5.menu.chip.85.build.mcu=attiny85
attinyx5.menu.chip.85.upload.maximum_size=8192
attinyx5.menu.chip.85.upload.maximum_data_size=512
attinyx5.menu.chip.45=ATtiny45
attinyx5.menu.chip.45.build.mcu=attiny45
attinyx5.menu.chip.45.upload.maximum_size=4096
attinyx5.menu.chip.45.upload.maximum_data_size=256
attinyx5.menu.chip.25=ATtiny25
attinyx5.menu.chip.25.build.mcu=attiny25
attinyx5.menu.chip.25.upload.maximum_size=2048
attinyx5.menu.chip.25.upload.maximum_data_size=128
attinyx5.menu.clock.8internal=8 MHz (internal)
attinyx5.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx5.menu.clock.8internal.build.f_cpu=8000000L
attinyx5.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.16pll=16 MHz (PLL)
attinyx5.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx5.menu.clock.16pll.build.f_cpu=16000000L
attinyx5.menu.clock.16pll.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.20external=20 MHz (external)
attinyx5.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.20external.build.f_cpu=20000000L
attinyx5.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.16external=16 MHz (external)
attinyx5.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.16external.build.f_cpu=16000000L
attinyx5.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.12external=12 MHz (external)
attinyx5.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.12external.build.f_cpu=12000000L
attinyx5.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.8external=8 MHz (external)
attinyx5.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx5.menu.clock.8external.build.f_cpu=8000000L
attinyx5.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.6external=6 MHz (external)
attinyx5.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx5.menu.clock.6external.build.f_cpu=6000000L
attinyx5.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.4external=4 MHz (external)
attinyx5.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx5.menu.clock.4external.build.f_cpu=4000000L
attinyx5.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.1internal=1 MHz (internal)
attinyx5.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx5.menu.clock.1internal.build.f_cpu=1000000L
attinyx5.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx5.menu.clock.128internal=128 kHz (internal)
attinyx5.menu.clock.128internal.bootloader.low_fuses=0xC4
attinyx5.menu.clock.128internal.build.f_cpu=128000L
attinyx5.menu.clock.128internal.bootloader.file=empty/empty_all.hex
attinyx5.menu.bod.disable=B.O.D. Disabled
attinyx5.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx5.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx5.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx5.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx5.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx5.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx5.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx5.build.variant=tinyX5

attinyx4.name=ATtiny x4 series
attinyx4.upload.maximum_size=8192
attinyx4.upload.maximum_data_size=512
attinyx4.upload.tool=avrdude
attinyx4.build.board=AVR_ATTINYX4
attinyx4.bootloader.tool=avrdude
attinyx4.bootloader.unlock_bits=0xFF
attinyx4.bootloader.lock_bits=0xFF
attinyx4.menu.chip.84=ATtiny84
attinyx4.menu.chip.84.build.mcu=attiny84
attinyx4.menu.chip.84.upload.maximum_size=8192
attinyx4.menu.chip.84.upload.maximum_data_size=512
attinyx4.menu.chip.44=ATtiny44
attinyx4.menu.chip.44.build.mcu=attiny44
attinyx4.menu.chip.44.upload.maximum_size=4096
attinyx4.menu.chip.44.upload.maximum_data_size=256
attinyx4.menu.chip.24=ATtiny24
attinyx4.menu.chip.24.build.mcu=attiny24
attinyx4.menu.chip.24.upload.maximum_size=2048
attinyx4.menu.chip.24.upload.maximum_data_size=128
attinyx4.build.core=tiny
attinyx4.bootloader.extended_fuses=0xFF
attinyx4.menu.clock.8internal=8 MHz (internal)
attinyx4.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx4.menu.clock.8internal.build.f_cpu=8000000L
attinyx4.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.20external=20 MHz (external)
attinyx4.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.20external.build.f_cpu=20000000L
attinyx4.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.16external=16 MHz (external)
attinyx4.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.16external.build.f_cpu=16000000L
attinyx4.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.12external=12 MHz (external)
attinyx4.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.12external.build.f_cpu=12000000L
attinyx4.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.8external=8 MHz (external)
attinyx4.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx4.menu.clock.8external.build.f_cpu=8000000L
attinyx4.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.6external=6 MHz (external)
attinyx4.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx4.menu.clock.6external.build.f_cpu=6000000L
attinyx4.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.4external=4 MHz (external)
attinyx4.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx4.menu.clock.4external.build.f_cpu=4000000L
attinyx4.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx4.menu.clock.1internal=1 MHz (internal)
attinyx4.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx4.menu.clock.1internal.build.f_cpu=1000000L
attinyx4.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx4.menu.bod.disable=B.O.D. Disabled
attinyx4.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx4.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx4.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx4.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx4.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx4.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx4.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx4.build.variant=tinyX4
attinyx4.menu.pinmapping.new=New style (D0 = A0, D1 = A1...)
attinyx4.menu.pinmapping.new.build.variant=tinyX4_Arduino_Numbering
attinyx4.menu.pinmapping.old=Old style (D10 = A0, D9 = A1...)
attinyx4.menu.pinmapping.old.build.variant=tinyX4

attinyx61.name=ATtiny x61 series
attinyx61.upload.maximum_size=8192
attinyx61.upload.maximum_data_size=512
attinyx61.upload.tool=avrdude
attinyx61.build.board=AVR_ATTINYX61
attinyx61.bootloader.tool=avrdude
attinyx61.bootloader.unlock_bits=0x03
attinyx61.bootloader.lock_bits=0x03
attinyx61.build.mcu=attiny861
attinyx61.build.core=tiny
attinyx61.menu.TimerClockSource.default=CPU
attinyx61.menu.TimerClockSource.pll=64MHz
attinyx61.menu.TimerClockSource.pll.build.extra_flags=-DPLLTIMER1
attinyx61.menu.TimerClockSource.lowpll=32MHz
attinyx61.menu.TimerClockSource.lowpll.build.extra_flags=-DLOWPLLTIMER1
attinyx61.menu.chip.861=ATtiny861
attinyx61.menu.chip.861.build.mcu=attiny861
attinyx61.menu.chip.861.upload.maximum_size=8192
attinyx61.menu.chip.861.upload.maximum_data_size=512
attinyx61.menu.chip.461=ATtiny461
attinyx61.menu.chip.461.build.mcu=attiny461
attinyx61.menu.chip.461.upload.maximum_size=4096
attinyx61.menu.chip.461.upload.maximum_data_size=256
attinyx61.menu.chip.261=ATtiny261
attinyx61.menu.chip.261.build.mcu=attiny261
attinyx61.menu.chip.261.upload.maximum_size=2048
attinyx61.menu.chip.261.upload.maximum_data_size=128
attinyx61.bootloader.extended_fuses=0x01
attinyx61.menu.clock.8internal=8 MHz (internal)
attinyx61.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx61.menu.clock.8internal.build.f_cpu=8000000L
attinyx61.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.20external=20 MHz (external)
attinyx61.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.20external.build.f_cpu=20000000L
attinyx61.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.16external=16 MHz (external)
attinyx61.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.16external.build.f_cpu=16000000L
attinyx61.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.16pll=16 MHz (PLL)
attinyx61.menu.clock.16pll.bootloader.low_fuses=0xF1
attinyx61.menu.clock.16pll.build.f_cpu=16000000L
attinyx61.menu.clock.16pll.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.12external=12 MHz (external)
attinyx61.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.12external.build.f_cpu=12000000L
attinyx61.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.8external=8 MHz (external)
attinyx61.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx61.menu.clock.8external.build.f_cpu=8000000L
attinyx61.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.6external=6 MHz (external)
attinyx61.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.6external.build.f_cpu=6000000L
attinyx61.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.4external=4 MHz (external)
attinyx61.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx61.menu.clock.4external.build.f_cpu=4000000L
attinyx61.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx61.menu.clock.1internal=1 MHz (internal)
attinyx61.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx61.menu.clock.1internal.build.f_cpu=1000000L
attinyx61.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx61.menu.bod.disable=B.O.D. Disabled
attinyx61.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx61.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx61.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx61.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx61.build.variant=tinyX61


attiny167opti.name=ATtiny167 (Optiboot)
attiny167opti.upload.maximum_data_size=512
attiny167opti.upload.protocol=arduino
attiny167opti.upload.tool=avrdude
attiny167opti.build.board=AVR_ATTINYX7
attiny167opti.bootloader.tool=avrdude
attiny167opti.bootloader.unlock_bits=0xFF
attiny167opti.bootloader.lock_bits=0xFF
attiny167opti.build.core=tiny
attiny167opti.bootloader.extended_fuses=0xFE
attiny167opti.build.mcu=attiny167
attiny167opti.upload.maximum_size=15744
attiny167opti.menu.clock.8internal=8 MHz (internal)
attiny167opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny167opti.menu.clock.8internal.build.f_cpu=8000000L
attiny167opti.menu.clock.8internal.bootloader.file=optiboot/optiboot_attiny167at8.hex
attiny167opti.menu.clock.8internal.upload.speed=57600
attiny167opti.menu.clock.16external=16 MHz (external)
attiny167opti.menu.clock.16external.bootloader.low_fuses=0xFF
attiny167opti.menu.clock.16external.build.f_cpu=16000000L
attiny167opti.menu.clock.16external.bootloader.file=optiboot/optiboot_attiny167at16.hex
attiny167opti.menu.clock.16external.upload.speed=115200
attiny167opti.menu.clock.12external=12 MHz (external)
attiny167opti.menu.clock.12external.bootloader.low_fuses=0xFF
attiny167opti.menu.clock.12external.build.f_cpu=12000000L
attiny167opti.menu.clock.12external.bootloader.file=optiboot/optiboot_attiny167at12.hex
attiny167opti.menu.clock.12external.upload.speed=115200
attiny167opti.menu.clock.8external=8 MHz (external)
attiny167opti.menu.clock.8external.bootloader.low_fuses=0xFF
attiny167opti.menu.clock.8external.build.f_cpu=8000000L
attiny167opti.menu.clock.8external.bootloader.file=optiboot/optiboot_attiny167at8.hex
attiny167opti.menu.clock.8external.upload.speed=57600
attiny167opti.menu.bod.disable=B.O.D. Disabled
attiny167opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny167opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny167opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attiny167opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny167opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny167opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny167opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attiny167opti.menu.pinmapping.new=New style (down each side)
attiny167opti.menu.pinmapping.new.build.variant=tinyX7_New
attiny167opti.menu.pinmapping.old=Old style (SCL on 13)
attiny167opti.menu.pinmapping.old.build.variant=tinyX7

attiny87opti.name=ATtiny87 (Optiboot)
attiny87opti.upload.maximum_data_size=512
attiny87opti.upload.protocol=arduino
attiny87opti.upload.tool=avrdude
attiny87opti.build.board=AVR_ATTINYX7
attiny87opti.bootloader.tool=avrdude
attiny87opti.bootloader.unlock_bits=0xFF
attiny87opti.bootloader.lock_bits=0xFF
attiny87opti.build.core=tiny
attiny87opti.bootloader.extended_fuses=0xFE
attiny87opti.build.mcu=attiny87
attiny87opti.upload.maximum_size=7552
attiny87opti.menu.clock.8internal=8 MHz (internal)
attiny87opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny87opti.menu.clock.8internal.build.f_cpu=8000000L
attiny87opti.menu.clock.8internal.bootloader.file=optiboot/optiboot_attiny87at8.hex
attiny87opti.menu.clock.8internal.upload.speed=57600
attiny87opti.menu.clock.16external=16 MHz (external)
attiny87opti.menu.clock.16external.bootloader.low_fuses=0xFF
attiny87opti.menu.clock.16external.build.f_cpu=16000000L
attiny87opti.menu.clock.16external.bootloader.file=optiboot/optiboot_attiny87at16.hex
attiny87opti.menu.clock.16external.upload.speed=115200
attiny87opti.menu.clock.12external=12 MHz (external)
attiny87opti.menu.clock.12external.bootloader.low_fuses=0xFF
attiny87opti.menu.clock.12external.build.f_cpu=12000000L
attiny87opti.menu.clock.12external.bootloader.file=optiboot/optiboot_attiny167at12.hex
attiny87opti.menu.clock.12external.upload.speed=115200
attiny87opti.menu.clock.8external=8 MHz (external)
attiny87opti.menu.clock.8external.bootloader.low_fuses=0xFF
attiny87opti.menu.clock.8external.build.f_cpu=8000000L
attiny87opti.menu.clock.8external.bootloader.file=optiboot/optiboot_attiny87at8.hex
attiny87opti.menu.clock.8external.upload.speed=57600
attiny87opti.menu.bod.disable=B.O.D. Disabled
attiny87opti.menu.bod.disable.bootloader.high_fuses=0xD7
attiny87opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny87opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attiny87opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny87opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attiny87opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny87opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attiny87opti.menu.pinmapping.new=New style (down each side)
attiny87opti.menu.pinmapping.new.build.variant=tinyX7_New
attiny87opti.menu.pinmapping.old=Old style (SCL on 13)
attiny87opti.menu.pinmapping.old.build.variant=tinyX7

