sleemanj/ATTinyCore/avr/boards.txt
attinyx7.name=ATtiny x7 series
attinyx7.upload.maximum_data_size=512
attinyx7.upload.tool=avrdude
attinyx7.build.board=AVR_ATTINYX7
attinyx7.bootloader.tool=avrdude
attinyx7.bootloader.unlock_bits=0xFF
attinyx7.bootloader.lock_bits=0xFF
attinyx7.build.core=tiny
attinyx7.bootloader.extended_fuses=0xFF
attinyx7.menu.chip.167=ATtiny167
attinyx7.menu.chip.167.build.mcu=attiny167
attinyx7.menu.chip.167.upload.maximum_size=16384
attinyx7.menu.chip.87=ATtiny87
attinyx7.menu.chip.87.build.mcu=attiny87
attinyx7.menu.chip.87.upload.maximum_size=8196
attinyx7.upload.maximum_data_size=512
attinyx7.menu.clock.8internal=8 MHz (internal)
attinyx7.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx7.menu.clock.8internal.build.f_cpu=8000000L
attinyx7.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.20external=20 MHz (external)
attinyx7.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.20external.build.f_cpu=20000000L
attinyx7.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.16external=16 MHz (external)
attinyx7.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.16external.build.f_cpu=16000000L
attinyx7.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.12external=12 MHz (external)
attinyx7.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.12external.build.f_cpu=12000000L
attinyx7.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.8external=8 MHz (external)
attinyx7.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.8external.build.f_cpu=8000000L
attinyx7.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.6external=6 MHz (external)
attinyx7.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx7.menu.clock.6external.build.f_cpu=6000000L
attinyx7.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.4external=4 MHz (external)
attinyx7.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx7.menu.clock.4external.build.f_cpu=4000000L
attinyx7.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx7.menu.clock.1internal=1 MHz (internal)
attinyx7.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx7.menu.clock.1internal.build.f_cpu=1000000L
attinyx7.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx7.menu.bod.disable=B.O.D. Disabled
attinyx7.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx7.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx7.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7.menu.pinmapping.new=New style (down each side)
attinyx7.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7.menu.pinmapping.old=Old style (SCL on 13)
attinyx7.menu.pinmapping.old.build.variant=tinyX7

attinyx8.name=ATtiny x8 series
attinyx8.upload.tool=avrdude
attinyx8.build.board=AVR_ATTINYX8
attinyx8.bootloader.tool=avrdude
attinyx8.bootloader.unlock_bits=0x3F
attinyx8.bootloader.lock_bits=0x3F
attinyx8.build.core=tiny
attinyx8.menu.chip.88=ATtiny88
attinyx8.menu.chip.88.build.mcu=attiny88
attinyx8.menu.chip.88.upload.maximum_size=8192
attinyx8.menu.chip.88.upload.maximum_data_size=512
attinyx8.menu.chip.48=ATtiny48
attinyx8.menu.chip.48.build.mcu=attiny48
attinyx8.menu.chip.48.upload.maximum_size=4096
attinyx8.menu.chip.48.upload.maximum_data_size=256
attinyx8.bootloader.extended_fuses=0x07
attinyx8.menu.clock.8internal=8 MHz (internal)
attinyx8.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx8.menu.clock.8internal.build.f_cpu=8000000L
attinyx8.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx8.menu.clock.1internal=1 MHz (internal)
attinyx8.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.1internal.build.f_cpu=1000000L
attinyx8.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx8.menu.bod.disable=B.O.D. Disabled
attinyx8.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx8.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx8.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx8.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx8.build.variant=tinyX8

attinyx313.name=ATtiny x313 series
attinyx313.upload.maximum_size=4096
attinyx313.upload.maximum_data_size=256
attinyx313.upload.tool=avrdude
attinyx313.bootloader.tool=avrdude
attinyx313.bootloader.unlock_bits=0x3F
attinyx313.bootloader.lock_bits=0x3F
attinyx313.build.core=tiny
attinyx313.build.board=AVR_ATTINYX313
attinyx313.bootloader.extended_fuses=0xFF
attinyx313.menu.chip.4313=ATtiny4313
attinyx313.menu.chip.4313.build.mcu=attiny4313
attinyx313.menu.chip.4313.upload.maximum_size=4096
attinyx313.menu.chip.4313.upload.maximum_data_size=256
attinyx313.menu.chip.2313=ATtiny2313
attinyx313.menu.chip.2313.build.mcu=attiny2313
attinyx313.menu.chip.2313.upload.maximum_size=2048
attinyx313.menu.chip.2313.upload.maximum_data_size=128
attinyx313.menu.clock.8internal=8 MHz (internal)
attinyx313.menu.clock.8internal.bootloader.low_fuses=0xE4
attinyx313.menu.clock.8internal.build.f_cpu=8000000L
attinyx313.menu.clock.8internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.20external=20 MHz (external)
attinyx313.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.20external.build.f_cpu=20000000L
attinyx313.menu.clock.20external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.16external=16 MHz (external)
attinyx313.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.16external.build.f_cpu=16000000L
attinyx313.menu.clock.16external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.12external=12 MHz (external)
attinyx313.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.12external.build.f_cpu=12000000L
attinyx313.menu.clock.12external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.8external=8 MHz (external)
attinyx313.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx313.menu.clock.8external.build.f_cpu=8000000L
attinyx313.menu.clock.8external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.1internal=1 MHz (internal)
attinyx313.menu.clock.1internal.bootloader.low_fuses=0x64
attinyx313.menu.clock.1internal.build.f_cpu=1000000L
attinyx313.menu.clock.1internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.4internal=4 MHz (internal)
attinyx313.menu.clock.4internal.bootloader.low_fuses=0xE2
attinyx313.menu.clock.4internal.build.f_cpu=4000000L
attinyx313.menu.clock.4internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.6external=6 MHz (external)
attinyx313.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.6external.build.f_cpu=6000000L
attinyx313.menu.clock.6external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.4external=4 MHz (external)
attinyx313.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx313.menu.clock.4external.build.f_cpu=4000000L
attinyx313.menu.clock.4external.bootloader.file=empty/empty_all.hex
attinyx313.menu.clock.5internal=0.5 MHz (internal)
attinyx313.menu.clock.5internal.bootloader.low_fuses=0x62
attinyx313.menu.clock.5internal.build.f_cpu=500000L
attinyx313.menu.clock.5internal.bootloader.file=empty/empty_all.hex
attinyx313.menu.bod.disable=B.O.D. Disabled
attinyx313.menu.bod.disable.bootloader.high_fuses=0x9F
attinyx313.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx313.menu.bod.1v8.bootloader.high_fuses=0x9D
attinyx313.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx313.menu.bod.2v7.bootloader.high_fuses=0x9B
attinyx313.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx313.menu.bod.4v3.bootloader.high_fuses=0x99
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.0=no
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1=yes
attinyx313.menu.INITIALIZE_SECONDARY_TIMERS.1.build.extra_flags=-DINITIALIZE_SECONDARY_TIMERS=1
attinyx313.build.variant=tinyX313

